Repository: Kostenkov-2021/linkLibrary
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: pt

source: Creating folder to store data files in home user directory ... You can press on Cancel button to skipt this, and adjust this later from the addon's settings dialog,Do you wants to proceed in creating the addons data folder in your home user directory?
pt: Criação de pasta para armazenar ficheiros de dados na pasta de utilizadores domésticos ... Pode pressionar o botão Cancelar para saltar isto, e ajustar mais tarde a partir do diálogo de configurações do extra, Deseja criar a pasta de dados do extra na sua pasta de utilizador doméstico?

source: Link Library
pt: Biblioteca de links

source: &Link Library
pt: &Biblioteca de links

source: Link Library Setting...
pt: Configuração da biblioteca de links...

source: Open Library Dialog
pt: Abrir o Diálogo da Biblioteca

source: Copy Library Folder
pt: Copiar pasta da biblioteca

source: Import Library Folder
pt: Importar a pasta da biblioteca

source: Open Link Library dialog.
pt: Abrir diálogo da Biblioteca de Links.

source: Link Library Settings
pt: Configurações da biblioteca de links

source: Choose Path to store Data Files
pt: Escolha o caminho para armazenar os ficheiros de dados

source: Add New Path
pt: Adicionar novo caminho

source: Remove Selected Path
pt: Remover o caminho selecionado

source: &Close dialog after activating a link
pt: &Fechar diálogo depois de ativar um link

source: This path({}) will be permanently removed. This action cannot be undone.
pt: Este caminho({}) será removido permanentemente. Esta ação não pode ser desfeita.

source: Warning
pt: Atenção

source: Copy Libraries Folder
pt: Copiar a pasta das bibliotecas

source: To copy libraries folder , please select the path and other options and then press Continue
pt: Para copiar a pasta bibliotecas, selecione o caminho e outras opções e pressione Continuar

source: Destination &directory:
pt: &Pasta de destino:

source: Browse...
pt: Localizar...

source: Select Directory
pt: Selecionar pasta

source: &Continue
pt: &Continuar

source: Please specify a directory.
pt: Por favor, especifique uma pasta.

source: Error
pt: Erro

source: %s is invalid, please select a valid directory path.
pt: %s é inválido, favor selecionar um caminho de pasta válido.

source: Sorry, copying libraries folder did not succeed
pt: Desculpe, a cópia da pasta das bibliotecas não foi bem sucedida

source: Information:Folder Copied
pt: Informações:Pasta copiada

source: Import Libraries Folder
pt: Importar a Pasta de Bibliotecas

source: To import libraries folder , please select the path of folder you want to import, and then press Continue
pt: Para importar a pasta das bibliotecas, selecione o caminho da pasta que você deseja importar e pressione Continuar

source: Directory of folder you want to import:
pt: Diretório da pasta que deseja importar:

source: Select Directory to import
pt: Selecionar pasta para importar

source: Sorry, but %s is invalid path.
pt: Desculpe, mas %s é um caminho inválido.

source: Check that the folder name is linkLibrary-addonFiles, and all files in it has a .json extension.
pt: Verifique se o nome da pasta é linkLibrary-addonFiles, e todos os ficheiros nela existentes têm uma extensão .json.

source: You should be aware by this import, the old linkLibrary-addonFiles will be removed and replaced by the newly imported one, and this can not be undone, are you sure you want to proceed?
pt: Deve estar ciente dos resultados desta importação: os ficheiros antigos da biblioteca de links serão removidos e substituídos pelos recém-importados. Isto não pode ser revertido; tem a certeza de que quer prosseguir?

source: Import libraries folder failed.
pt: A pasta de importação de bibliotecas falhou.

source: Information: Libraries folder imported successfuly.
pt: Informações: Pasta de bibliotecas importadas com sucesso.

source: Add new path
pt: Adicionar novo caminho

source: Path of the directory:(c:\users\...)
pt: Caminho da pasta:(c:utilizador...)

source: Enter a general name for the path(example dropbox or Documents or any other)
pt: Digite um nome geral para o caminho (exemplo caixa de dropbox ou Documentos ou qualquer outro)

source: This name is already present for another library, enter another name please
pt: Este nome já está presente para outra biblioteca, digite outro nome, por favor

source: Json File
pt: Ficheiro do JSON

source: Html File
pt: Ficheiro Html

source: Export Library As
pt: Exportar Biblioteca como

source: Import Library(as Json)
pt: Importar Biblioteca (como Json)

source: Failed to export library
pt: Falha na exportação da biblioteca

source: Information: Library Exported
pt: Informações: Biblioteca Exportada

source: Failed to open library, or may be library file is not valid.
pt: Falha ao abrir a biblioteca, ou pode ser um ficheiro de biblioteca que não seja válido.

source: Importfailed; chosen file seems not valid.
pt: Importação falhada; o ficheiro escolhido parece não ser válido.

source: Import Error
pt: Erro de importação

source: Sorry, importing of library failed
pt: Desculpe, a importação da biblioteca falhou

source: Information: Library imported.
pt: Informações: Biblioteca importada.

source: A library with similar name already exists, do you want to merge the two libraries?
pt: Já existe uma biblioteca com nome semelhante, quer fundir as duas bibliotecas?

source: Information
pt: Informações

source: Link Library - {}
pt: Biblioteca de Links - {}

source: Choose a library
pt: Escolha uma biblioteca

source: Add
pt: Adicionar

source: Rename
pt: Renomear

source: Remove
pt: Remover

source: Cancel
pt: Cancelar

source: Information:Failed to create directory.
pt: Informações:Falha na criação da pasta.

source: Enter library name please
pt: Digite o nome da biblioteca, por favor

source: Add Library
pt: Adicionar biblioteca

source: Enter new name please
pt: Digite um novo nome, por favor

source: rename
pt: renomear

source: Are you sure you want to remove {} library, this can not be undone?
pt: Tem a certeza de que quer remover a biblioteca {}, isto não pode ser desfeito?

source: A library dialog is already opened; Close it first please.
pt: Um diálogo de biblioteca já está aberto; feche-o primeiro, por favor.

source: information
pt: informação

source: This url is for {}; please enter another one
pt: Esta url é para {}; por favor, digite outra url

source: This label({}) is chosen for {}; please enter another one
pt: Esta etiqueta({}) é escolhida para {}; por favor insira outra

source: Add A Link
pt: Adicionar um link

source: Edit Selected
pt: Editar Selecionado

source: Move Link To
pt: Mover link para

source: Remove Selected
pt: Remover Selecionado

source: Remove All
pt: Remover todos

source: Enter Link source(www...)
pt: Escreva a fonte do Link (www...)

source: Enter Link Label Please
pt: Digite etiqueta para o Link, Por favor

source: Link Label
pt: Rótulo do Link

source: Write Something About The Link
pt: Escreva algo sobre o link

source: About
pt: Sobre

source: This link is already present in {library} library, under {label} label; Do you still want to replace it with the one you are about to move?.
pt: Este link já está presente na biblioteca {library}, sob a etiqueta {label}; Ainda quer substituí-lo por aquele que está prestes a mover?.

source: Unable to move the link to another library
pt: Incapaz de mover o link para outra biblioteca

source: Are you sure you want to remove the link labeled {} from the library?, this can not be undone.
pt: Tem a certeza de que quer remover o link etiquetado {} da biblioteca?, isto não pode ser desfeito.

source: Are you sure you want to remove all links from this library?, this can not be undone.
pt: Você tem certeza de que quer remover todos os links desta biblioteca?, isto não pode ser desfeito.

source: List Of Links
pt: Lista de links

source: About The Link
pt: Sobre o link

source: Show Source Url
pt: Mostrar fonte Url

source: Open Link With
pt: Abrir Link com

source: Unable to load links data
pt: Incapaz de carregar dados de links

source: This addon helps the user to arrange his links or bookmarks in library like way. From the main dialog of libraries, you can choose the library or category you like and press enter on it. On the opened dialog, you will have all links in that category in a list and have access to source url an the about info of each llink if present. This addon does not come with a default or assigned gesture or shortcut to it You can as always add a gesture or change the existed one going to : NVDA menu>preferences>inputGestures>Link Library.
pt: Este extra ajuda o utilizador a organizar os seus links ou marcadores de página em bibliotecas. A partir do diálogo principal das bibliotecas, pode escolher a biblioteca ou categoria que gosta e pressionar enter nela. No diálogo aberto, terá todos os links dessa categoria, numa lista e terá acesso à url de origem e à informação sobre cada link, se presente. Este extra não vem com uma tecla de atalho atribuído Pode, como sempre, adicionar um atalho ou mudar o já existente : Menu do NVDA>preferências>definir comandos>biblioteca de links.
